# **Assignment 6**

### *Task 1*

In [1]:
import pandas as pd
import numpy as np
import time

In [2]:
customers = pd.read_csv("customers.csv")
sales = pd.read_excel("Sales.xlsx")

In [3]:
#Displaying first few rows
print("Customers:\n", customers.head(),"\n")
print("Sales:\n", sales.head())

Customers:
    CustomerID  Age         City
0           1   22     New York
1           2   23  Los Angeles
2           3   24      Chicago
3           4   25      Houston
4           5   26      Phoenix

Sales:
    SaleID  CustomerID     Product  Amount
0     101           1      Laptop     200
1     102           2  Smartphone     500
2     103           3      Tablet     800
3     104           4  Headphones    1100
4     105           5     Monitor    1400

In [4]:
#Total Rows and Columns
print("\nCustomers", customers.shape,"\n")
print("Sales:", sales.shape)

Customers (100, 3)

Sales: (400, 4)

In [5]:
#Checking missing values
print("Customers:\n", customers.isnull().sum())
print("Sales:\n", sales.isnull().sum())

Customers:
 CustomerID    0
Age           0
City          0
dtype: int64
Sales:
 SaleID        0
CustomerID    0
Product       0
Amount        0
dtype: int64

In [6]:
#No missing values so moving to next task

### *Task 2*

In [7]:
#Making Dictionary
startdic = time.time()
dic = customers.set_index("CustomerID").to_dict(orient="index")
enddic = time.time()
dic

{1: {'Age': 22, 'City': 'New York'},
 2: {'Age': 23, 'City': 'Los Angeles'},
 3: {'Age': 24, 'City': 'Chicago'},
 4: {'Age': 25, 'City': 'Houston'},
 5: {'Age': 26, 'City': 'Phoenix'},
 6: {'Age': 27, 'City': 'New York'},
 7: {'Age': 28, 'City': 'Los Angeles'},
 8: {'Age': 29, 'City': 'Chicago'},
 9: {'Age': 30, 'City': 'Houston'},
 10: {'Age': 31, 'City': 'Phoenix'},
 11: {'Age': 32, 'City': 'New York'},
 12: {'Age': 33, 'City': 'Los Angeles'},
 13: {'Age': 34, 'City': 'Chicago'},
 14: {'Age': 35, 'City': 'Houston'},
 15: {'Age': 36, 'City': 'Phoenix'},
 16: {'Age': 37, 'City': 'New York'},
 17: {'Age': 38, 'City': 'Los Angeles'},
 18: {'Age': 39, 'City': 'Chicago'},
 19: {'Age': 40, 'City': 'Houston'},
 20: {'Age': 41, 'City': 'Phoenix'},
 21: {'Age': 42, 'City': 'New York'},
 22: {'Age': 43, 'City': 'Los Angeles'},
 23: {'Age': 44, 'City': 'Chicago'},
 24: {'Age': 45, 'City': 'Houston'},
 25: {'Age': 46, 'City': 'Phoenix'},
 26: {'Age': 47, 'City': 'New York'},
 27: {'Age': 48, 'City': 'Los Angeles'},
 28: {'Age': 49, 'City': 'Chicago'},
 29: {'Age': 50, 'City': 'Houston'},
 30: {'Age': 51, 'City': 'Phoenix'},
 31: {'Age': 22, 'City': 'New York'},
 32: {'Age': 23, 'City': 'Los Angeles'},
 33: {'Age': 24, 'City': 'Chicago'},
 34: {'Age': 25, 'City': 'Houston'},
 35: {'Age': 26, 'City': 'Phoenix'},
 36: {'Age': 27, 'City': 'New York'},
 37: {'Age': 28, 'City': 'Los Angeles'},
 38: {'Age': 29, 'City': 'Chicago'},
 39: {'Age': 30, 'City': 'Houston'},
 40: {'Age': 31, 'City': 'Phoenix'},
 41: {'Age': 32, 'City': 'New York'},
 42: {'Age': 33, 'City': 'Los Angeles'},
 43: {'Age': 34, 'City': 'Chicago'},
 44: {'Age': 35, 'City': 'Houston'},
 45: {'Age': 36, 'City': 'Phoenix'},
 46: {'Age': 37, 'City': 'New York'},
 47: {'Age': 38, 'City': 'Los Angeles'},
 48: {'Age': 39, 'City': 'Chicago'},
 49: {'Age': 40, 'City': 'Houston'},
 50: {'Age': 41, 'City': 'Phoenix'},
 51: {'Age': 42, 'City': 'New York'},
 52: {'Age': 43, 'City': 'Los Angeles'},
 53: {'Age': 44, 'City': 'Chicago'},
 54: {'Age': 45, 'City': 'Houston'},
 55: {'Age': 46, 'City': 'Phoenix'},
 56: {'Age': 47, 'City': 'New York'},
 57: {'Age': 48, 'City': 'Los Angeles'},
 58: {'Age': 49, 'City': 'Chicago'},
 59: {'Age': 50, 'City': 'Houston'},
 60: {'Age': 51, 'City': 'Phoenix'},
 61: {'Age': 22, 'City': 'New York'},
 62: {'Age': 23, 'City': 'Los Angeles'},
 63: {'Age': 24, 'City': 'Chicago'},
 64: {'Age': 25, 'City': 'Houston'},
 65: {'Age': 26, 'City': 'Phoenix'},
 66: {'Age': 27, 'City': 'New York'},
 67: {'Age': 28, 'City': 'Los Angeles'},
 68: {'Age': 29, 'City': 'Chicago'},
 69: {'Age': 30, 'City': 'Houston'},
 70: {'Age': 31, 'City': 'Phoenix'},
 71: {'Age': 32, 'City': 'New York'},
 72: {'Age': 33, 'City': 'Los Angeles'},
 73: {'Age': 34, 'City': 'Chicago'},
 74: {'Age': 35, 'City': 'Houston'},
 75: {'Age': 36, 'City': 'Phoenix'},
 76: {'Age': 37, 'City': 'New York'},
 77: {'Age': 38, 'City': 'Los Angeles'},
 78: {'Age': 39, 'City': 'Chicago'},
 79: {'Age': 40, 'City': 'Houston'},
 80: {'Age': 41, 'City': 'Phoenix'},
 81: {'Age': 42, 'City': 'New York'},
 82: {'Age': 43, 'City': 'Los Angeles'},
 83: {'Age': 44, 'City': 'Chicago'},
 84: {'Age': 45, 'City': 'Houston'},
 85: {'Age': 46, 'City': 'Phoenix'},
 86: {'Age': 47, 'City': 'New York'},
 87: {'Age': 48, 'City': 'Los Angeles'},
 88: {'Age': 49, 'City': 'Chicago'},
 89: {'Age': 50, 'City': 'Houston'},
 90: {'Age': 51, 'City': 'Phoenix'},
 91: {'Age': 22, 'City': 'New York'},
 92: {'Age': 23, 'City': 'Los Angeles'},
 93: {'Age': 24, 'City': 'Chicago'},
 94: {'Age': 25, 'City': 'Houston'},
 95: {'Age': 26, 'City': 'Phoenix'},
 96: {'Age': 27, 'City': 'New York'},
 97: {'Age': 28, 'City': 'Los Angeles'},
 98: {'Age': 29, 'City': 'Chicago'},
 99: {'Age': 30, 'City': 'Houston'},
 100: {'Age': 31, 'City': 'Phoenix'}}

In [8]:
#Filtering by city
filtered = {i: j for i, j in dic.items() if j["City"] == "New York"}
filtered

{1: {'Age': 22, 'City': 'New York'},
 6: {'Age': 27, 'City': 'New York'},
 11: {'Age': 32, 'City': 'New York'},
 16: {'Age': 37, 'City': 'New York'},
 21: {'Age': 42, 'City': 'New York'},
 26: {'Age': 47, 'City': 'New York'},
 31: {'Age': 22, 'City': 'New York'},
 36: {'Age': 27, 'City': 'New York'},
 41: {'Age': 32, 'City': 'New York'},
 46: {'Age': 37, 'City': 'New York'},
 51: {'Age': 42, 'City': 'New York'},
 56: {'Age': 47, 'City': 'New York'},
 61: {'Age': 22, 'City': 'New York'},
 66: {'Age': 27, 'City': 'New York'},
 71: {'Age': 32, 'City': 'New York'},
 76: {'Age': 37, 'City': 'New York'},
 81: {'Age': 42, 'City': 'New York'},
 86: {'Age': 47, 'City': 'New York'},
 91: {'Age': 22, 'City': 'New York'},
 96: {'Age': 27, 'City': 'New York'}}

In [9]:
#Filtering using dataframe
startdf = time.time()
filtered_df = customers[customers["City"] == "New York"]
enddf = time.time()
filtered_df

    CustomerID  Age      City
0            1   22  New York
5            6   27  New York
10          11   32  New York
15          16   37  New York
20          21   42  New York
25          26   47  New York
30          31   22  New York
35          36   27  New York
40          41   32  New York
45          46   37  New York
50          51   42  New York
55          56   47  New York
60          61   22  New York
65          66   27  New York
70          71   32  New York
75          76   37  New York
80          81   42  New York
85          86   47  New York
90          91   22  New York
95          96   27  New York

In [10]:
#Checking efficiency
print("Dictionary time: ", enddic - startdic, "\nDataFrame Time: ", enddf - startdf)

Dictionary time:  0.0
DataFrame Time:  0.0

### *Task 3*

In [11]:
#Verifying duplicates
print("Customers:", customers.duplicated().sum(), "\n")
print("Sales:", sales.duplicated().sum())

Customers: 0

Sales: 0

In [12]:
# No duplicates so moving to next task

### Task 4

In [13]:
# Add discounted amount column
sales["AfterDiscount"] = sales["Amount"] * 0.9
sales.head()

   SaleID  CustomerID     Product  Amount  AfterDiscount
0     101           1      Laptop     200          180.0
1     102           2  Smartphone     500          450.0
2     103           3      Tablet     800          720.0
3     104           4  Headphones    1100          990.0
4     105           5     Monitor    1400         1260.0

In [14]:
#Total Sales by Product
total = sales.groupby("Product")["AfterDiscount"].sum().reset_index()
print("Total Sales:\n", total)

Total Sales:
       Product  AfterDiscount
0  Headphones        79200.0
1      Laptop        14400.0
2     Monitor       100800.0
3  Smartphone        36000.0
4      Tablet        57600.0

### *Task 5*

In [15]:
#Filtering by Age
age = customers[(customers["Age"] >= 25) & (customers["Age"] <= 35)]
age.head()

   CustomerID  Age         City
3           4   25      Houston
4           5   26      Phoenix
5           6   27     New York
6           7   28  Los Angeles
7           8   29      Chicago

In [16]:
#Saving to new structure
age.to_csv("filtered_customers.csv", index=False)

In [17]:
filtered = pd.read_csv("filtered_customers.csv")
filtered.head()

   CustomerID  Age         City
0           4   25      Houston
1           5   26      Phoenix
2           6   27     New York
3           7   28  Los Angeles
4           8   29      Chicago

In [18]:
#Counting customers by city
counts = age["City"].value_counts()
print("City Counts", counts)

City Counts City
Houston        11
Phoenix         8
New York        7
Los Angeles     7
Chicago         7
Name: count, dtype: int64

### *Task 6*

In [19]:
# Merge datasets
merged_data = pd.merge(sales, customers, on="CustomerID", how="inner")
merged_data.head()

   SaleID  CustomerID     Product  Amount  AfterDiscount  Age         City
0     101           1      Laptop     200          180.0   22     New York
1     102           2  Smartphone     500          450.0   23  Los Angeles
2     103           3      Tablet     800          720.0   24      Chicago
3     104           4  Headphones    1100          990.0   25      Houston
4     105           5     Monitor    1400         1260.0   26      Phoenix

In [20]:
#Ciry with most sales
city = merged_data.groupby("City")["Amount"].sum().idxmax()
city

'Phoenix'

In [21]:
# Count occurrences of each product (number of units sold)
most = merged_data["Product"].value_counts().idxmax()
most

'Laptop'

### *Task 7*

In [22]:
# Unique values
ucities = merged_data["City"].unique()
uproducts = merged_data["Product"].unique()
print("Unique Cities:", ucities)
print("Unique Products:", uproducts)

Unique Cities: ['New York' 'Los Angeles' 'Chicago' 'Houston' 'Phoenix']
Unique Products: ['Laptop' 'Smartphone' 'Tablet' 'Headphones' 'Monitor']

In [23]:
# Mean and median
mean = merged_data["Amount"].mean()
median = merged_data["Amount"].median()
print("Mean of Amount:", mean)
print("Median of Amount:", median)

Mean of Amount: 800.0
Median of Amount: 800.0